src/Documents/ЗаявкаНаПеревозку/ЗаявкаНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПеревозку</name>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГруза</name>
    <type>
      <types>CatalogRef.ВидыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПеревозку</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ШтрихкодыДокументов/ШтрихкодыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыДокументов</name>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПеревозку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗаявкаНаПеревозку/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТипЗнч(Параметры.ПараметрыВыбора) = Тип("Структура")
			И Параметры.ПараметрыВыбора.Свойство("Заказчик")
			И ЗначениеЗаполнено(Параметры.ПараметрыВыбора.Заказчик) Тогда
			Объект.Заказчик = Параметры.ПараметрыВыбора.Заказчик
		ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.Заказчик) Тогда
			Объект.Заказчик = ПараметрыСеанса.ТекущийПользователь.Заказчик;
		КонецЕсли;
	КонецЕсли;
	ЭтоПолноправныйПользователь = РольДоступна("ПолныеПрава");
	Элементы.Заказчик.ТолькоПросмотр = Не ЭтоПолноправныйПользователь;
	Элементы.ГруппаШтрихкодСтаутс.Видимость = ЭтоПолноправныйПользователь;
	ОбновитьШтрихкод();
КонецПроцедуры

&НаСервере
Процедура ОбновитьШтрихкод()
	Штрихкод = РегистрыСведений.ШтрихкодыДокументов.ШтрихкодДокумента(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьШтрихкод();
КонецПроцедуры
